In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [3]:
df = sns.load_dataset('titanic')

In [7]:
location = np.argmax(df.groupby(['age']).count().survived.values)

In [8]:
df = pd.read_csv('train.csv')

In [9]:
##나이가 25세이상인 Mr. 결혼한 사람
##호칭이 Mrs. 결혼한 사람
## 결혼한 사람의 사망,생존 갯수
남자결혼한사람 = (df.Age >= 25) & (df.Name.str.contains('Mr.'))
여자결혼한사람 = (df.Name.str.contains('Mrs.'))
결혼한사람 = 남자결혼한사람 | 여자결혼한사람
결혼하지않은사람 = ~결혼한사람
married = np.where(결혼한사람,'married','unmarried')

In [10]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [11]:
df['married'] = married

In [12]:
df.groupby([married,'Survived']).count().Pclass

           Survived
married    0           246
           1           158
unmarried  0           303
           1           184
Name: Pclass, dtype: int64

In [13]:
df.groupby([married,'Survived']).agg(['sum','mean','std','count','min']).Fare

C:\Users\bjlov\AppData\Local\Temp\ipykernel_9008\4132066079.py:1: FutureWarning: ['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked', 'married'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  df.groupby([married,'Survived']).agg(['sum','mean','std','count','min']).Fare

                          sum       mean        std  count     min
          Survived
married   0         5706.6954  23.197949  29.953858    246  0.0000
          1         7913.1377  50.083150  67.365605    158  0.0000
unmarried 0         6436.0245  21.241005  32.529055    303  0.0000
          1         8638.0917  46.946151  66.079415    184  7.1417

In [15]:
'오늘의 점심은 뭐먹죠'

'오늘의 점심은 뭐먹죠'

In [17]:
date = np.datetime64('2022-01-01')
date = date + np.arange(365)

In [18]:
amount = np.random.randint(10,100,date.size)

In [19]:
location = np.random.choice(['a','b','c','d'],date.size)

In [22]:
sales = pd.DataFrame()
sales['date'] = date
sales['location'] = location
sales['amount'] = amount

In [27]:
import warnings
warnings.filterwarnings(action='ignore')
#월별  얼마나 팔았나?
#월별 지점별 얼마나 팔았나
#일별 지점별 얼마 팔았나
#월별 지점별 평균 얼마:나 팔았나
month = sales.date.astype('str').str[5:7]
sales.groupby(month).sum().amount #1번
sales.groupby([month,'location']).sum().amount #2번
day = sales.date.astype('str').str[8:10]
sales.groupby(day).sum().amount # 3번
sales.groupby([month,'location']).mean().amount #4번
## pivot ==> column, row Transpose
sales['month'] = month

In [28]:
sales

          date location  amount month
0   2022-01-01        c      42    01
1   2022-01-02        c      98    01
2   2022-01-03        b      32    01
3   2022-01-04        b      56    01
4   2022-01-05        a      55    01
..         ...      ...     ...   ...
360 2022-12-27        d      53    12
361 2022-12-28        b      48    12
362 2022-12-29        b      89    12
363 2022-12-30        a      69    12
364 2022-12-31        d      78    12

[365 rows x 4 columns]

In [38]:
sales.pivot_table(index = ['location'],
           columns = ['month'],
           values = ['amount'],
           aggfunc=['mean'])

sales.pivot_table(index = ['month'],
           columns = ['location'],
           values = ['amount'],
           aggfunc=['sum'])

sales.pivot_table(index = ['month'],
           columns = ['location'],
           values = ['amount'],
           aggfunc=['sum']).T

month                 01   02   03   04   05   06   07   08   09   10   11  \
           location
sum amount a         374  658  505  693  584  361  247  693  320  551  463
           b         696  123  405  530  439  442  660  473  490  449  474
           c         506  558  350  213  370  465  176  186  485  591  385
           d         186  329  681  518  405  417  492  292  426  411  342

month                 12
           location
sum amount a         496
           b         532
           c         346
           d         332

In [46]:
sales.groupby([month,'location']).sum().reset_index().pivot_table(index='date',
                                                                  columns='location',
                                                                  values='amount')

location    a    b    c    d
date
01        374  696  506  186
02        658  123  558  329
03        505  405  350  681
04        693  530  213  518
05        584  439  370  405
06        361  442  465  417
07        247  660  176  492
08        693  473  186  292
09        320  490  485  426
10        551  449  591  411
11        463  474  385  342
12        496  532  346  332

In [36]:
sales.pivot_table(index = ['month'],
           columns = ['location'],
           values = ['amount'],
           aggfunc=['sum']).size

48

In [ ]:
del all